class_name Advertisement
extends Resource
## کلاس پایه تبلیغات جهت نگه داری اطلاعات و نمایش آن توسط نود ادیوری 
## [br]
## از این کلاس به تنهاییی استفاده نکنید 
##
## کلاس پایه تبلیغات جهت نگه داری اطلاعات و نمایش آن توسط نود ادیوری 
## [br]
## از این کلاس به تنهاییی استفاده نکنید. 
## [br]
## جهت استفاده اطمینان حاصل کنید که مقدار [member placement_id] با [member type] آن مطابقت داشته باشند در غیر این صورت با خطا روبه رو خواهید شد. 

## نود تبلیغات 
enum Type {
	## هیچکدام 
	NONE,
	## باز شدن اپلیکیشن
	APP_OPEN,
	## میان صفحه ای
	INTERSTITIAL,
	## جایزه ای
	REWARDED,
}

## نود تبلیغات 
var type: Type

func _init() -> void:
	type = Type.NONE
